vvpai9/Keil/Keil_v5/ARM/INC/TI/TMS570_device.h
/**********************************************************DMA***********************************************************************/
#define  DMA 	 		0xFFFFF000                                /*DMA Address*/
#define  DMA_RAM 		0xFFF80000                                /*DMA RAM Address*/
#define  DMA_FTC_INT 	33                                                /*Frame Transfer Complete Intr*/
#define  DMA_LFS_INT 	34                                                /*Last Frame Transfer Started Intr*/
#define  DMA_HBC_INT 	39                                                /*First Half of Block Complete Intr*/
#define  DMA_BTC_INT 	40                                                /*Block Transfer Complete Intr*/
#define  DMA_BER_INT 	41                                                /*Bus Error Intr*/
#define  NUM_DMA_REQUESTS_32                                              /*Total Number Of Peripheral DMA Requests*/
#define  DMA_CNTL_PKTS 16                                                 /*DMA Control Packets*/
#define  DMA_RAM_INIT 1							  /*DMA Memory Initialization Channel*/
#define BER_ERROR_ADDR	0x1B00C300					  //0x0401FFF0
#define BMM_SLAVE_ADDR	0xff460000                                       




/********************************************************RTI***********************************************************************/
#define  NUM_RTI1_COMP0_INT 2                                            /*Interrupt Channel For Compare 0*/
#define  NUM_RTI1_COMP1_INT 3                                            /*Interrupt Channel For Compare 1*/
#define  NUM_RTI1_COMP2_INT 4                                            /*Interrupt Channel For Compare 2*/
#define  NUM_RTI1_COMP3_INT 5                                            /*Interrupt Channel For Compare 3*/
#define  NUM_RTI1_OVL0_INT  6                                            /*Interrupt Channel For FRC0*/
#define  NUM_RTI1_OVL1_INT  7                                            /*Interrupt Channel For FRC1*/
#define  NUM_RTI1_TBASE_INT 8                                            /*Timebase Interrupt Channel*/
#define  NUM_RTI1_DMA_REQ0  12                                           /*DMAREQ number for Compare 0*/
#define  NUM_RTI1_DMA_REQ1  13                                           /*DMAREQ number for Compare 1*/
#define  NUM_RTI1_DMA_REQ2  18                                           /*DMAREQ number for Compare 2*/
#define  NUM_RTI1_DMA_REQ3  19                                           /*DMAREQ number for Compare 3*/


#define SOURCEADDRESS  		0x00002000				 /* Source Address for Transfer data */
#define DESTINATIONADDRESS 	0x00002500				 /* Destination Addresss for transfer data */

#define RAM_DMA_CH       3						 /* DMA Channel No */


/*******************************************************FLASH************************************************************************/
#define FLASH             	0xFFF87000				/* Starting Address for FLASH */				
#define FLASH_VOlTAGE      	0xFFF87000
#define FLASH_CMD          	0xFFF87000

#define ESM_Mapping							/* Flash errors are being mapped to ESM */
#define FWM_ECC_INTERNAL    						/* Antares has internal ECC i.e R4 has ECC enabled */

									/* channnel used by DMA in order to read flash */
#define DOUBLE_ERROR_INT 1 						/* this is required to make test backward compatible */

#define FLASH_ERROR2 0 							/* This is required in order to make the testcases backward compatible */
#define FLASH_ERROR1 -1

#define Bank_busy 0xF0 							/* Register reset values - only 4 banks are available */
#define FWM_REV_ID 0x1467
#define FIQnIRQ 1

/* Since in Antares the number of sectors is more we are using Bank's starting & ending address */

#define MAX_SEC 10

/* Bank zero */
#define Bzero_SecOpt_start 0x8000000
#define Bzero_SecOpt_End   0x8008000

/* Bank one */
#define Bzero_SecZero_start 0x8008000
#define Bzero_SecZero_End   0x8010000

/* Bank two */
#define Bzero_SecOne_start 0x8010000
#define Bzero_SecOne_End   0x8018000

/* Bank three */
#define Bzero_SecTwo_start 0x8018000
#define Bzero_SecTwo_End   0x801A000

#define Bzero_SecThree_start 0x801A000
#define Bzero_SecThree_End   0x801C000

#define Bzero_SecFour_start 0x801C000
#define Bzero_SecFour_End   0x8020000

#define Bzero_SecFive_start 0x8020000
#define Bzero_SecFive_End   0x8030000

#define Bzero_SecSix_start  0x8030000
#define Bzero_SecSix_End    0x8040000

#define Bzero_SecSeven_start 0x8040000
#define Bzero_SecSeven_End   0x8060000

#define Bzero_SecEight_start 0x8060000
#define Bzero_SecEight_End   0x8080000


/* Initializing the other constants of the test to zero - as they are not used */
 
#define Bzero_SecNine_start 0x00
#define Bzero_SecNine_End 0x00

#define data_int  0x88888888
#define data_sh   0x8888
#define data_char 0x88

#define FLASH_ILLEGAL	0x08200000
/**********************************************************************************************************************************/
/*	 					MODULE ADDRESS		   							  */
/**********************************************************************************************************************************/
/* This Adress is kept for Compilation	*/
#define Dummy_Address 		0xffffffff
#define MCRC             	0xFE000000
#define CORESIGHT_TPIU  	0xFFA03000
#define ETM_R4          	0xFFA02000 
#define CORTEX_R4       	0xFFA01000 
#define CORESIGHT_DBG_ROM       0xFFA00000 
#define PCR             	0xFFFFE000
#define SYSTEM          	0xFFFFFF00 
#define CPU_SLFTST      	0xFFFFE600 
#define DMA             	0xFFFFF000 
#define ESM             	0xFFFFF500 
#define CCMR4           	0xFFFFF600
#define DMM             	0xFFFFF700 
#define RAM_ECC_EVN     	0xFFFFF800 
#define RAM_ECC_ODD     	0xFFFFF900 
#define RTP             	0xFFFFFA00
#define RTI             	0xFFFFFC00
#define VIM             	0xFFFFFE00
#define MIBSPI1        		0xFFF7F400
#define MIBSPI3        		0xFFF7F800
#define MIBSPIP5        	0xFFF7FC00
#define LIN             	0xFFF7E400      /* LIN0 */
#define LIN1             	0xFFF7E500	/* LIN1 */
#define LIN2             	Dummy_Address   /* LIN2 */
#define LIN3             	Dummy_Address   /* LIN3 */
#define DCAN3            	0xFFF7E000
#define DCAN2            	0xFFF7DE00
#define DCAN1            	0xFFF7DC00
#define FRAY            	0xFFF7C800
#define FRAYTU          	0xFFF7A000
#define MIBADC1          	0xFFF7C000
#define MIBADC2          	0xFFF7C200
#define GIO1             	0xFFF7BC00
#define NHET             	0xFFF7B800
#define HTU             	0xFFF7A400



#define VIM_PARITY              0xFFFFFDEC      /*  The parity registers starts from offset 0xEC */

/****************************************************************************************************************/
/*				 MODULE RAM ADDDRESS						     		*/
/****************************************************************************************************************/
#define MIBSPIP5_RAM    	0xFF0A0000
#define MIBSPI3_RAM    		0xFF0C0000
#define MIBSPI1_RAM    		0xFF0E0000
#define DCAN3_RAM        	0xFF1A0000
#define DCAN2_RAM        	0xFF1C0000
#define DCAN1_RAM        	0xFF1E0000
#define MIBADC1_RAM      	0xFF3E0000
#define MIBADC2_RAM      	0xFF3A0000
#define NHET_RAM         	0xFF460000
#define HTU_RAM         	0xFF4E0000
#define VIM_RAM         	0xFFF82000
#define FRAYTU_RAM      	0xFF500000
#define DMA_RAM         	0xFFF80000
#define RTP_RAM_MEM        	0xFFF83000 


/*    For Device which has pheripheral    with parity   */
#define FRAYTU_PARITY 	 	YES
#define MIBSPIP1_PARITY  	YES
#define MIBSPIP3_PARITY	 	YES
#define MIBSPIP5_PARITY  	YES
#define FTU_PARITY		YES



/****************************************************************************************************************/
/*	                            VIM				                     	     			*/
/****************************************************************************************************************/
#define REG_COUNT			52
#define VIM_RAM_SIZE			64


#define VIM_RAM_PARITY			0xfff82400
#define VIM_PARITYBIT_SWIINT_LOC 	0xFFF82458

