vvpai9/Keil/Keil_v5/ARM/INC/TI/TMS570_device.h
#define INTREQ 		0x3F3F3F3F           /* no of interrupt request channels */
#define CAPEVNTREQ  	0x003F003F 


/****************************************************************************************************************/
/*	 			VIM CHANNELS / INTERRUPT LINES					     		*/
/****************************************************************************************************************/
#define VIM_CHANNELS			64		/* No of Channels in VIM */ 
#define NO_NMI_RESV			 2 		/* No of revserved or NMI interrupts*/
#define PHANTOM_INT			-1 		// to be used in main as (PHANTOM_INT + 1)
							/* ESM LINES */
#define ESM_INT              		 0
#define ESM_LVL0_INT        		20
							/* RTI LINES */
#define RTI_COMP0_INT		 	 2
#define RTI_COMP1_INT		 	 3
#define RTI_COMP2_INT		 	 4 
#define RTI_COMP3_INT		 	 5 
#define RTI_OVL0_INT			 6 
#define RTI_OVL1_INT		 	 7
#define RTI_TBASE_INT        	 	 8
									/*GIO LINES*/
#define GIO1_LVL0_INT        		 9
#define GIO1_LVL1_INT       		23
									/*NHET LINES */
#define NHET_LVL0_INT       		10
#define NHET_LVL1_INT       		24
									/*HTU LINES*/
#define HTU_LVL0_INT        		11
#define HTU_LVL1_INT        		25
									/*MIBSPI #1*/
#define MIBSPI1_LVL0_INT    		12
#define MIBSPI1_LVL1_INT    		26
									/*MIBSPI #3*/		
#define MIBSPI3_LVL0_INT		37
#define MIBSPI3_LVL1_INT		38
									/*MIBSPI #5*/
#define MIBSPIP5_LVL0_INT		53
#define MIBSPIP5_LVL1_INT		56
									/*SPI # 1*/
#define SPI1_LVL0_INT    		12
#define SPI1_LVL1_INT      		26
									/*SPI # 3*/
#define SPI3_LVL0_INT			37                                     
#define SPI3_LVL1_INT			38				

#define SPI5_LVL0_INT			53                                     
#define SPI5_LVL1_INT			56				/*SPI # 5*/

#define RESERVED       			17
#define RESERVED1       		30
				
									/* LIN LINES*/
#define LIN_LVL0_INT        		13
#define LIN_LVL1_INT        		27

#define LIN1_LVL0_INT       		49
#define LIN1_LVL1_INT       		54

									/*ADM1 LINES*/
#define ADM1_EV_INT	   		14
#define ADM1_GP1_INT        		15
#define ADM1_MTCI_INT       		31
#define ADM1_GP2_INT        		28
									/*ADM2 LINES*/
#define ADM2_EV_INT	    		50
#define ADM2_GP1_INT        		51
#define ADM2_MTCI_INT       		59
#define ADM2_GP2_INT        		57
					
									/*DCAN LINES #1*/
#define DCAN1_LVL0_INT      		16
#define DCAN1_LVL1_INT      		29

									/*DCAN LINES #1*/
#define DCAN2_LVL0_INT			35
#define DCAN2_LVL1_INT			42

									/*DCAN LINES #1*/
#define DCAN3_LVL0_INT			45
#define DCAN3_LVL1_INT			55

									/*FLEXRAY LINES*/
//#define FRAY_T1C_INT			62
//#define FRAY_TOC_INT			52
//#define FRAY_LVL1_INT       		32
//#define FRAY_LVL0_INT       		18
	
									/*FLEXRAY TU LINES*/
//#define FRAY_TU_ERR_INT			58
//#define RESERVED3			61
//#define FRAY_TU_TRSFR_ST_INT 		48

									/* CRC LINES*/
#define CRC_LVL0_INT        		19

									/*SYSTEM */
#define SYS_SW_INT          		21
#define PMU_INT            		22


									/*DMM LINES*/
#define DMM_LVL0_INT			36
#define DMM_LVL1_INT			43



/*************************************************************************************************************************/
/*					RAM ADDRESS DEFINITIONS								 */ 				
/*************************************************************************************************************************/
								
#define RAM_BASE 0x00001100				/* RAM BASE ADDRESS */
#define ECC_BASE 0x00401103				/* ECC BASE ADDRESS */

#define ECC_INTERNAL					/* When ECC is calculated by CPU */


							/* BIT access Address */
#define DATA_Addr_EVN  0x00000000
#define SET_Addr_EVN   0x00080000
#define CLR_Addr_EVN   0x00100000
#define DATA_Addr_ODD  0x00000004
#define SET_Addr_ODD   0x00080004
#define CLR_Addr_ODD   0x00100004

							/* Define ESM Present */
#define ESM_PRESENT 1

/**********************************************************************************************************************/
/*	 				DMA REQUEST LINES							      */
/**********************************************************************************************************************/
#define	MIBSPI1_TG1_DMA_REQ		 0

#define	MIBSPI1_TG0_DMA_REQ		 1
#define NUM_DMA_CHANNELS		16


#define	MIBSPI1_TG2_DMA_REQ		 4
#define	MIBSPI3_TG2_DMA_REQ		 4
#define	DCAN2_IF3_DMA_REQ		 4

#define	MIBSPI1_TG3_DMA_REQ		 5
#define	MIBSPI3_TG3_DMA_REQ		 5
#define	DCAN2_IF2_DMA_REQ		 5

#define	MIBSPIP5_TG2_DMA_REQ		 6
#define	DCAN1_IF2_DMA_REQ		 6

#define MIBADC1_EV_DMA_REQ		 7
#define	MIBSPIP5_TG3_DMA_REQ		 7

#define	MIBSPI1_TG4_DMA_REQ	 	 8
#define	MIBSPI3_TG4_DMA_REQ		 8
#define	DCAN1_IF1_DMA_REQ		 8

#define	MIBSPI1_TG5_DMA_REQ	 	 9
#define	MIBSPI3_TG5_DMA_REQ		 9
#define	DCAN2_IF1_DMA_REQ		 9

#define	MIBADC1_G1_DMA_REQ		10
#define	MIBSPIP5_TG4_DMA_REQ		10

#define	MIBADC1_G2_DMA_REQ		11
#define	MIBSPIP5_TG5_DMA_REQ		11

#define RTI_DMA_REQ0			12
#define	MIBSPI1_TG6_DMA_REQ		12
#define	MIBSPI3_TG6_DMA_REQ		12

#define RTI_DMA_REQ1			13
#define	MIBSPI1_TG7_DMA_REQ		13
#define	MIBSPI3_TG7_DMA_REQ		13

#define	MIBSPI3_TG1_DMA_REQ		14
#define	MIBSPIP5_TG6_DMA_REQ		14
#define MIBADC2_EV_DMA_REQ		14

#define	MIBSPI3_TG0_DMA_REQ		15
#define	MIBSPIP5_TG7_DMA_REQ		15

#define	MIBSPI1_TG8_DMA_REQ		16
#define	MIBSPI3_TG8_DMA_REQ		16
#define	MIBADC2_G1_DMA_REQ		16
#define	DCAN1_IF3_DMA_REQ		16

#define	MIBSPI1_TG9_DMA_REQ		17
#define	MIBSPI3_TG9_DMA_REQ		17
#define	MIBADC2_G2_DMA_REQ		17
#define	DCAN3_IF1_DMA_REQ		17

#define RTI_DMA_REQ2			18
#define	MIBSPIP5_TG8_DMA_REQ		18

#define RTI_DMA_REQ3			19
#define	MIBSPIP5_TG9_DMA_REQ		19

#define HET_DMA_REQ4			20    
#define LIN1_RX_DMA_REQ 		20
#define	DCAN3_IF2_DMA_REQ		20

#define LIN1_TX_DMA_REQ 		21
#define HET_DMA_REQ5	 		21
#define	DCAN3_IF3_DMA_REQ		21

#define	MIBSPI1_TG10_DMA_REQ		22
#define	MIBSPI3_TG10_DMA_REQ		22
#define	MIBSPIP5_TG10_DMA_REQ		22

#define	MIBSPI1_TG11_DMA_REQ		23
#define	MIBSPI3_TG11_DMA_REQ		23

#define	MIBSPIP5_TG11_DMA_REQ		23

#define HET_DMA_REQ6 			24
#define	MIBSPIP5_TG12_DMA_REQ		24

