vvpai9/Keil/Keil_v5/ARM/INC/TI/TMS570_device.h
#define HET_DMA_REQ7 			25
#define	MIBSPIP5_TG13_DMA_REQ		25

#define CRC_DMA_REQ0			26
#define	MIBSPI1_TG12_DMA_REQ		26
#define	MIBSPI3_TG12_DMA_REQ		26

#define CRC_DMA_REQ1			27    
#define	MIBSPI1_TG13_DMA_REQ		27
#define	MIBSPI3_TG13_DMA_REQ		27

#define LIN_RX_DMA_REQ 			28
#define	MIBSPIP5_TG14_DMA_REQ		28

#define LIN_TX_DMA_REQ 			29
#define	MIBSPIP5_TG15_DMA_REQ		29

#define	MIBSPI1_TG14_DMA_REQ		30
#define	MIBSPI3_TG14_DMA_REQ		30
#define	MIBSPIP5_TG1_DMA_REQ		30

#define	MIBSPI1_TG15_DMA_REQ		31
#define	MIBSPI3_TG15_DMA_REQ		31
#define	MIBSPIP5_TG0_DMA_REQ		31


/******************************************************************************************************************/
/*				Defined CLK Source for ALL valid Channels 					  */
/* 			    done by 'or' all aviabale CLK channels 0|1|4|5|6    				  */
/******************************************************************************************************************/
#define CLK_SRC_CHANNELS   0x73


/******************************************************************************************************************/
/*	 			MEMORY AUTO_INITIALISATION						          */
/******************************************************************************************************************/
#define CPU_RAM_INIT		 0
#define MIBSPIP5_RAM_INIT	12
#define MIBSPI3_RAM_INIT	11
#define MIBSPI1_RAM_INIT	 7
#define DCAN3_RAM_INIT		10
#define DCAN2_RAM_INIT		 6
#define DCAN1_RAM_INIT		 5
#define AWM1_RAM_INIT		 8
#define NHET_RAM_INIT		 3
#define HTU_RAM_INIT		 4
#define DMA_RAM_INIT		 1
#define VIM_RAM_MEM_INIT	 2
#define FTU_RAM_INIT		13
#define AWM2_RAM_INIT		14

//Channel lines for Memory tests
 
#define YES 		1
#define NO 		0

//MEMORY AUTO-INITIALIZATION CHANNELS
#define DMA_ch		YES
#define ADC_ch		YES
#define DCAN1_ch	YES
#define DCAN2_ch	YES
#define DCAN3_ch	YES
#define VIM_ch		YES
#define NHET_ch		YES
#define SPI_ch		YES
#define HET_ch 		NO
#define HETTU_ch	YES
#define MIBSPI2_ch 	YES
#define MIBSPI3_ch  	YES
#define ADC2_ch     	YES
#define FTU_RAM_ch  	YES



#ifdef SPI
#undef SPI
#define SPI MIBSPIP1
#endif



/* RAM LOWER & UPPER BOUNDARY TEST */
#define SRAM_LB  0x00001000
#define SRAM_UB  0x00002ef0

#define MIBSPI_LB 0xFF0E0000
#define MIBSPI_UB 0xFF0E0200


/* CRC channels */
#define NUM_CRC_CHANNELS_2



/************************************************************************************************************************/
/*	 				ESM  CHANNELS							     		*/
/************************************************************************************************************************/

#define ESM_G1_MIBADC2_PARITY		 	 1		  
#define ESM_G1_DMA_MPV				 2		  
#define ESM_G1_DMA_PARITY			 3
#define ESM_G1_SYS_DMA_TRAN			 5
#define ESM_G1_FLASH_SINGLE_ECC		 	 6
#define ESM_G1_HET_PARITY			 7
#define ESM_G1_HET_TU_PARITY		 	 8
#define ESM_G1_HET_TU_MPV			 9
#define ESM_G1_PLL_SLIP				10
#define ESM_G1_CLK_MONITOR			11
#define ESM_G1_FLEXRAY_PARITY			12
#define ESM_G1_IMPRECISE_ERR			13
#define ESM_G1_FLEXRAY_TU_PARITY		14
#define ESM_G1_VIM_PARITY			15
#define ESM_G1_FLEXRAY_TU_MPV			16
#define ESM_G1_MIBSPI1_PARITY			17
#define ESM_G1_MIBSPI3_PARITY			18
#define ESM_G1_MIBADC1_PARITY			19
#define RESERVED4				20
#define ESM_G1_CAN1_PARITY			21
#define ESM_G1_CAN3_PARITY			22
#define ESM_G1_CAN2_PARITY			23
#define ESM_G1_MIBSPIP5_PARITY			24
#define RESERVED5				25
#define ESM_G1_RAM_SINGLE_EVEN			26
#define ESM_G1_CPU_SELFTEST			27
#define ESM_G1_RAM_SINGLE_ODD			28
#define ESM_G1_PBIST_SELFTEST			29
#define RESERVED6				30
#define ESM_G1_CCMR4_SELFTEST			31
#define ESM_G2_CCMR4_COMPARE			34
#define ESM_G2_FLASH_ECC			36
#define ESM_G2_RAM_DOUBLE_EVEN			38
#define ESM_G2_RAM_DOUBLE_ODD			40
#define ESM_G2_RAM_ADDR_PARITY_EVEN		42
#define ESM_G2_RAM_ADDR_PARITY_ODD		44
//#define ESM_G3_RAM_ECC_DOUBLE_EVEN		66
//#define ESM_G3_RAM_ECC_DOUBLE_ODD		68
#define ESM_G3_FLASH_ECC				70
#define ESM_G3_CHAN_3					03
#define ESM_G3_CHAN_5					05


/***************************************END IF ESM CHANNELS******************************************************************/


/****************************************************************************************************************************/
/*					 MODULE CONFIGURATION						     		    */
/****************************************************************************************************************************/
								/* RTI Configuration */
#define NUM_RTI_COUNTERS_2 
#define NUM_RTI_CMP_INT_4
#define RTI_NODWD

								/* MIBSPI1 Configuration */
#define NUM_MIBSPI1_CS_4
#define NUM_MIBSPI1_ENA
#define NUM_TRNSFR_GROUPS			8


								/* MIBSPI3 Configuration */
#define NUM_MIBSPI3_CS_4
#define NUM_MIBSPI3_ENA
#define NUM_TRNSFR_GROUPS			8


								/* MIBSPIP5 Configuration */
#define NUM_MIBSPIP5_SIMO_PINS			4
#define NUM_MIBSPIP5_SOMI_PINS			4
#define NUM_MIBSPIP5_CS_4
#define NUM_MIBSPIP5_ENA
#define NUM_TRNSFR_GROUPS			8

								/* GIO Configuration */
#define NUM_GIO_PORTS				2
#define GIO1_Pins_on_PortA			8
#define GIO1_Pins_on_PortB			8
#define GIO1_Pins_on_PortC			0
#define GIO1_Pins_on_PortD			0
#define GIO1_Pins_on_PortE			0
#define GIO1_Pins_on_PortF			0
#define GIO1_Pins_on_PortG			0
#define GIO1_Pins_on_PortH			0
#define GIO1_Interrupt_capable_pins_on_PortA 	8 
#define GIO1_Interrupt_capable_pins_on_PortB 	0
#define GIO1_Interrupt_capable_pins_on_PortC 	0
#define GIO1_Interrupt_capable_pins_on_PortD 	0

								/* NHET Configuration */
#define NUM_NHET_PINS				32

								/* DCAN1 Configuration */
#define NUM_DCAN1_MESSAGES			64

								/* DCAN2 Configuration */
#define NUM_DCAN2_MESSAGES			64

								/* DCAN3 Configuration */
#define NUM_DCAN3_MESSAGES			32

								/*RTP Configuration */
#define NUM_RTPDATA_PINS 			16

								/*DMM Configuration */
#define NUM_DMMDATA_PINS 			16

								/*ETM Configuration */
#define NUM_ETMDATA_PINS_31

								/* ADM1 configurations */
#define ADM1_NUM_OF_CHAN			16
#define ADM1_NUM_OF_MAGTHR   			 6              /* no. of Magnitude threshold registers */

								/* ADM2 configurations */
#define ADM2_NUM_OF_CHAN    			16
#define ADM2_NUM_OF_MAGTHR   			 6    	       //no. of Magnitude threshold registers

