vvpai9/Keil/Keil_v5/ARM/INC/TI/TMS570_device.h
								/* AWM1 No of channels */
#define AWM1_NUM_OF_CHAN			16

/**************************************MEMORY Range Testing definitions**************************************************/

#define MIBSPIP1_RAM_WORDS 128
#define MIBSPIP3_RAM_WORDS 128
#define MIBSPIP5_RAM_WORDS 128
#define NHET_RAM_INSTRCTNS 128
#define DCAN1_MSG_SIZE     NUM_DCAN1_MESSAGES
#define DCAN2_MSG_SIZE     NUM_DCAN2_MESSAGES
#define DCAN3_MSG_SIZE     NUM_DCAN#_MESSAGES
#define HETTU_DCP_PCKTS      8
#define DMA_CNTL_PCKTS     NUM_DMA_CHANNELS
#define ADC1_RAM_WORDS 	    64
#define ADC2_RAM_WORDS 	    64
#define VIM_CHNLS	   VIM_CHANNELS
#define FRAYTU_MSG_RAM	    64 



/*************************************VIM INTERRUPT REMAP channels********************************************************/

#define INT_REMAP_CH1	MIBSPI1_LVL0_INT	//12
#define INT_REMAP_CH2	LIN_LVL0_INT		//13
#define INT_REMAP_CH3	ADM1_EV_INT		//14
#define INT_REMAP_CH4	ADM1_GP1_INT		//15
                                                    
/*********************************NOTE::   Plesae add channels 12, 13,14,15 to the defines on the Lft hand side                                           
					   END OF VIM INTERRUPT REMAP CHANNELS********************************************/

/* Pull Functionality */
#define PULLDIS_TIEOFF		  	  0

#define NO_PULL				  0
#define PULL_DOWN			  1
#define PULL_UP				1<<1
#define INPUT				  0
#define OUTPUT				1<<2

/*#define INPUT_PULL_UP	2*/

#define HET_PULL			INPUT|PULL_DOWN
#define CAN1_PULL			INPUT|PULL_UP
#define CAN2_PULL			INPUT|PULL_UP
#define GIOA_PULL			INPUT|PULL_DOWN
#define ADC1_PULL			INPUT|PULL_DOWN
#define ADC2_PULL			INPUT|PULL_DOWN
#define SCI1_PULL			INPUT|PULL_UP
#define SCI2_PULL			INPUT|PULL_UP

#define MIBSPI1_PULL 			INPUT|PULL_UP 	//..Momin
#define CAN1_OPNDRN        	 	DISABLE
#define CAN2_OPNDRN        		 DISABLE
#define LIN_PULL			INPUT|PULL_UP

//For SYS module
#define DISABLE_ON_RESET    		2
#define ENABLE_ON_RESET     		2
#define ENABLE  			1
#define ECLK_PULL       		INPUT & PULL_DOWN
#define LPO_HFRQ_CLK			DISABLE_ON_RESET
#define CLK_DOMAIN 			DISABLE_ON_RESET
#define CLK_SRC_DOMAIN			ENABLE_ON_RESET
#define CLK_SRC_VALID			ENABLE_ON_RESET
#define PLL_CTL				ENABLE


//For VIM module
#define VIM_NMI_DEFINE3 2  

//For MEMINIT testcases in SYSTEM module

#define MEM_CH_DMARAM		0x02		/*Channel number is 1*/
#define MEM_CH_VIMRAM		0x04		/*Channel number is 2*/
#define MEM_CH_NHETRAM		0x08		/*Channel number is 3*/
#define MEM_CH_HETTURAM		0x10		/*Channel number is 4*/
#define MEM_CH_DCAN1RAM		0x20		/*Channel number is 5*/
#define MEM_CH_DCAN2RAM		0x40		/*Channel number is 6*/
#define MEM_CH_DCAN3RAM		0x400		/*Channel number is 10*/
#define MEM_CH_MIBSPI1RAM	0x80		/*Channel number is 7*/
#define MEM_CH_MIBSPI2RAM	0x800		/*Channel number is 11*/
#define MEM_CH_MIBSPI3RAM	0x1000		/*Channel number is 12*/
#define MEM_CH_MIBADC1RAM	0x100		/*Channel number is 8*/
#define MEM_CH_MIBADC2RAM	0x4000		/*channel number is 14*/
#define MEM_CH_FTURAM		0x2000		/*channel number is 13*/
#define MEM_CH_RAMWRAPPER	0x01		/*channel number is 0*/


#define ALL_channels		0x7DFE

#define RAM_ILL_ADDRESS	    	0x28000         //ANTARES 160KB of RAM
#define VBUS_ILL_ADDRESS	0xFFF70000      //ANTARES 
#define FLASH_ILL_ADDRESS   	0x08200000      //ANTARES FLASH END ADDRESS(2MB)


//Device specific Parameters FOR SYSTEM Register Testcase
//#define CSDIS_VALUE 		0x000000CE    // Commented because of conflict with TMS570_system.h file
//#define PLLCTL1     		0x2F025F00
//#define PLLCTL2     		0x7FC07200
//#define CSVSTAT     		0x00000073

//For Memory Initialization of RAM testcase ran from FLASH
#define RAM_ADDR		0x08000000

//DeviceID of the ANTARES
#define DEVICE_ID 		0x80206D0D


//Variables for TCRAMW module
#define RAM_EVEN_LOCATION  	0x1100
#define RAM_ODD_LOCATION   	0x1108


//Chip selects for MIBSPI for MEMINIT testcases
#define NUMBER_MIBSPI1_CS 4  //4 chip selects for MIBSPI1 
#define NUMBER_MIBSPI3_CS 4  //4 chip selects for MIBSPI2
#define NUMBER_MIBSPI5_CS 4  //4 chip selects for MIBSPI3


//Definition for Number of bits for ADC module (MEMINIT testcase)
#define NO_OF_BITS_ADC1 12 	//For ANTARES ADC1 =12 bits
#define NO_OF_BITS_ADC2 12  	//For ANTARES ADC2 =12 bits

//RTP DMM Memory Tracing regions
#define RTP_DMM_RAM_REG1 	0x2800
#define RTP_DMM_RAM_REG2	0x2C00
#define RTP_DMM_DMA_RAM_REG1	0x4000
#define RTP_DMM_DMA_RAM_REG2	0x4400


//Mster ID values
#define DMA_MASTER_ID 		2
#define DMM_MASTER_ID 		3
#define DAP_MASTER_ID 		4

/********************************************POM********************************************************************/

#define POM	     			0xFFA04000 
#define NUM_POM_REG     		32	                  /*No of regions*/
#define POM_ADDRMAP_START		0x60000000
#define POM_ADDRMAP_END			0x603FFFFC



/****************************************PBIST Entires**************************************************************/


#define PBIST 				0xFFFFE500 		/* Base Address of PBIST - As the address from offset 0x400 - 0x500 are reserved,the PBIST configaration register starts only from 0xFFFFE500 onwards */

#define PBIST_CH1_ALGO 			0x01			/*PBIST  ROM */
#define PBIST_CH1 			0x0001

#define PBIST_CH2_ALGO 			0x1554			/* STC MEM  Single Port*/	
#define PBIST_CH2 			0x0002

#define PBIST_CH3_ALGO 			0x1554			/* DCAN1- Single port*/
#define PBIST_CH3 			0x0004

#define PBIST_CH4_ALGO 			0x1554     		/* DCAN2-Single port */
#define PBIST_CH4 			0x0008

#define PBIST_CH5_ALGO 			0x1554			/*DCAN3-Single port */
#define PBIST_CH5 			0x00010

#define PBIST_CH6_ALGO 			0x1554			/*ESRAM - single Port*/
#define PBIST_CH6 			0x0020

#define PBIST_CH7_ALGO 			0x1554			/* MIBSPI -Single port*/
#define PBIST_CH7 			0x0040

#define PBIST_CH8_ALGO 			0x1554			/* VIM  Single port */
#define PBIST_CH8 			0x0080

#define PBIST_CH9_ALGO 			0x2AA8			/* MIBADC - Two port*/
#define PBIST_CH9 			0x0100

#define PBIST_CH10_ALGO 		0x400	 		/* DMA Two port Only sliced algo */
#define PBIST_CH10 			0x0200

