vvpai9/Keil/Keil_v5/ARM/INC/TI/TMS570_device.h
#define PBIST_CH11_ALGO 		0x2AA8			/* HET Two port */
#define PBIST_CH11 			0x0400

#define PBIST_CH12_ALGO 		0x2AA8			/* HTU  Two port */
#define PBIST_CH12 			0x0800


#define PBIST_CH13_ALGO 		0x2AA8			/* RTP Two port */
#define PBIST_CH13 			0x1000


#define PBIST_CH14_ALGO 		0x0F			/* FLEXRAY  single port */
#define PBIST_CH14 			0x0001

#define PBIST_CH15_ALGO 		0x0F			/* ESRAM single port*/
#define PBIST_CH15 			0x0001



//For DEVICE RAM with PARITY Generation
#define MIBADC1_PARITY    	YES
#define MIBADC2_PARITY    	YES
#define DMA_PARITY 		YES
#define DCAN1_PARITY 		YES
#define DCAN2_PARITY 		YES
#define DCAN3_PARITY 		YES
#define HTU_PARITY		YES
#define NHET_PARITY  		YES

#define DMA_RAM_PARITY 		0xfff80A00
#define HET_RAM_PARITY 		0xff4e0200
#define NHET_RAM_PARITY 	0xff462000
#define FRAYTU_RAM_PARITY 	0xff500200


/*****************************************EMIF*****************************************************************************/
#define EMIF     		0xFFFFE800 
#define NUM_EMIF_CS     	4	                  /*No of Chip Select*/
#define EMIF_CS0_ADDRMAP_START	0x60000000
#define EMIF_CS0_ADDRMAP_END	0x63FFFFFC
#define EMIF_CS1_ADDRMAP_START	0x64000000
#define EMIF_CS1_ADDRMAP_END	0x67FFFFFC
#define EMIF_CS2_ADDRMAP_START	0x68000000
#define EMIF_CS2_ADDRMAP_END	0x6BFFFFFC
#define EMIF_CS3_ADDRMAP_START	0x6C000000
#define EMIF_CS3_ADDRMAP_END	0x6FFFFFFC
/**************************************************************************************************************************/


/************************************************* FTU ********************************************************************/

#define FTU1			0xFFF7A000
#define FTU1_END		0xFFF7A400
#define FTU1_RAM		0xFF500000
#define FTU1_ERR_INT		58
#define FTU1_TRSFR_ST_INT	48
#define FTU1_RAM_INIT		05
#define ESM_G1_FTU1_PARITY	14
#define ESM_G1_FTU1_MPV		18
#define FTU1_RAM_WORDS		64


#define FRAY            	0xFFF7C800
#define FRAY_T1C_INT		62		    /*FLEXRAY LINES*/
#define FRAY_TOC_INT		52
#define FRAY_LVL1_INT       	45
#define FRAY_LVL0_INT           43
//#define FRAY1_TU_MPU_INT		16		    	/*ESM Interrupt line for FTU - MPU*/
//#define FRAY1_TU_PARITY_INT		14	            /*ESM Interupt line for FTU - Parity*/


